tutorials/PGF_DEM_test/0.orig/H2O
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      H2O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1.;

boundaryField
{
    wallTop
    {
     type            zeroGradient;
    }
    wallSides
    {
        type            zeroGradient;
    }
    wallBottom
    {
        type            fixedValue;
        value           uniform .99;
    }

}


// ************************************************************************* //
