tutorials/PGF_DEM_test/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    wallTop
    {
        type            zeroGradient;

    }
    wallSides
    {
       type             fixedValue;
       value            uniform (0 0 0);
    }
    wallBottom
    {
        type            fixedValue ;
         value           uniform (0 -0.0001 0);
    }

}


// ************************************************************************* //
