tutorials/PGF_DEM_test/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.1;
    format      binary;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistry           on;

chemistryType
{
    solver            ode;
}

solidChemistryType
{
    solver              solidOde;
    method              ODESolidHeterogeneousChemistryModel;
    solidThermoType     const<constRad<constThermo<constRho>>>;
}

chemistrySolver     ode;

solidChemistrySolver	solidOde;

initialChemicalTimeStep 1e-5;

turbulentReaction   off;
solidReactionEnergyFromEnthalpy false;
stoichiometricReactions false;
showRelativeReactionRates false;

diffusionLimitedReactions true;

odeCoeffs
{
    solver          seulex;
}

solidOdeCoeffs
{
    solver     Trapezoid;
}

species 	//gasous products of reactions
(
    H2O NI 
);

solidReactions
(
    irreversibleSolidArrheniusHeterogeneousReaction
    powder = 0.01 pouch  + 0.99 NI 
    (10e0 0.015 200 0 1)
);

// ************************************************************************* //


