tutorials/PGF_DEM_test/constant/lambdaDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      lambdaDict;
}

lambdaDot
{
    type coded;
    code
    #{
        return 0.1*sin(x);
    #};
}
