tutorials/PGF_DEM_test/constant/thermo.compressibleGas
species
(
   H2O
   H2t
   NI
);

NI
{
    specie
    {
        molWeight       28000.0106;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 3.04849 0.00135173 -4.85794e-07 7.88536e-11 -4.69807e-15 -14266.1 6.0171 );
        lowCpCoeffs     ( 3.57953 -0.000610354 1.01681e-06 9.07006e-10 -9.04424e-13 -14344.1 3.50841 );
        Cp              4000;
        Hf              -286000;
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
        mu              0.001;
        Pr              11;
    }
}

H2O
{
    specie
    {
        molWeight       28000.0134;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 2.92664 0.00148798 -5.68476e-07 1.0097e-10 -6.75335e-15 -922.798 5.98053 );
        lowCpCoeffs     ( 3.29868 0.00140824 -3.96322e-06 5.64152e-09 -2.44486e-12 -1020.9 3.95037 );
        Cp              4000;
        Hf              -286000;
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
        mu              0.001;
        Pr              11;
    }
}

H2t
{
    specie
    {
        molWeight       28000.0134;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 2.92664 0.00148798 -5.68476e-07 1.0097e-10 -6.75335e-15 -922.798 5.98053 );
        lowCpCoeffs     ( 3.29868 0.00140824 -3.96322e-06 5.64152e-09 -2.44486e-12 -1020.9 3.95037 );
        Cp              4000;
        Hf              -286000;
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
        mu              0.001;
        Pr              11;
    }
}

// ************************************************************************* //
