tutorials/PGF_DEM_test/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

fields 
(
    O2
    N2
    CO
    Ts
    T
    p
    Ywood
    Yash
    porosityF
    rhos 
    Msolidtotal
    Srho
);

probeLocations
(
    (0.01 0 1e-6)
    (0.01 0 1e-2)
    (0.01 0 2.01e-2)
    (0.01 0 3e-2)
    (0.01 0 4e-2)
    (0.01 0 5e-2)
    (0.01 0 6e-2)
    (0.01 0 7e-2)
    (0.01 0 8e-2)
    (0.01 0 10e-2)
    (0.01 0 11e-2)
    (0.01 0 12e-2)
    (0.01 0 13e-2)
    (0.01 0 14e-2)
    (0.01 0 15e-2)
    (0.01 0 15.99e-2)
    (0.01 0 17e-2)
);

// ************************************************************************* //
