tutorials/PGF_DEM_test/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue Ts  300
    volScalarFieldValue porosityF  1. 
    volScalarFieldValue porosityF0 1. 
    volScalarFieldValue Ypowder 0. 
    volScalarFieldValue Ypouch 1. 
);

regions
(
  boxToCell
  {
      box (-0.01001 0.00020001 -0.001) (0.01001 0.00380001 0.001);
      fieldValues
      (
          volScalarFieldValue porosityF  0.5
          volScalarFieldValue porosityF0 0.5
          volScalarFieldValue sneakyDiffusionModifier 0.01
      );
  }

  boxToCell
  {
      box (-0.009001 0.000500001 -0.0008) (0.0090001 0.00350001 0.0008);
      fieldValues
      (
          volScalarFieldValue porosityF  0.9
          volScalarFieldValue porosityF0 0.9
          volScalarFieldValue sneakyDiffusionModifier 0.1
          volScalarFieldValue Ypowder 1. 
          volScalarFieldValue Ypouch  0. 
      );
  }
);

// ************************************************************************* //
